{
  "home": "الرئيسية",
  "about": " من نحن",
  "services": "الخدمات",
  "projects": "المشاريع",
  "news": "الاخبار",
  "contact": "تواصل معنا",

  "aboutUs": {
    "title": "نبذة عنا",
    "paragraph1": "تأسست شركة جيل المستقبل لتقنيات المعلومات برؤية واضحة تهدف إلى تقديم حلول طاقة شمسية موثوقة وعالية الكفاءة مصممة خصيصاً لتلبية احتياجات السوق العراقي. منذ انطلاقتها ركزت الشركة على بناء خبرة تقنية قوية وتقديم خدمات متكاملة تغطي جميع مراحل المشروع من التخطيط وحتى التنفيذ.",

    "paragraph2": "خلال فترة تجاوزت العامين، نجحت الشركة في تنفيذ أكثر من 300 مشروع طاقة شمسية في القطاعات السكنية والتجارية والصناعية داخل بغداد وبابل، مما يعكس التزامنا المستمر بالجودة والأداء وثقة العملاء.",

    "paragraph3": "تعتمد عملياتنا على فرق فنية مدربة ومعدات تم اختيارها بعناية، إضافة إلى تطوير مستمر لقدراتنا التقنية. ولا يقتصر دورنا على التصميم والتنصيب فقط، بل يشمل أيضاً خدمات الصيانة والدعم الفني وضمان الأداء على المدى الطويل لتحقيق قيمة مستدامة لعملائنا.",

    "paragraph4": "وانطلاقاً من حضورنا القوي في السوق المحلية، تتوسع جيل المستقبل حالياً نحو المشاريع الحكومية والمشاريع الكبيرة، مع العمل على تطوير شراكات استراتيجية لتعزيز نطاق تأثيرها. ونسعى من خلال ذلك إلى الإسهام في بناء مستقبل طاقة أكثر استقراراً في العراق من خلال تقليل الاعتماد على مصادر الطاقة التقليدية وتشجيع حلول الطاقة المستدامة.",
    "buttun": " اقرا المزيد     >>>>"
  },

  "missionVision": {
    "title": "الرؤية والرسالة",
    "missionTitle": "رسالتنا | Mission",
    "visionTitle": "رؤيتنا | Vision",

    "mission": [
      "تقديم منظومات طاقة شمسية عالية الجودة ومتكاملة مصممة وفق احتياجات العملاء.",
      "توفير خدمة عملاء متميزة وتجربة سلسة ومتكاملة للعملاء.",
      "تقديم دعم فني مستمر وخدمات ما بعد البيع الموثوقة.",
      "تنفيذ حلول فعّالة تساهم في التخفيف من مشكلة انقطاع الكهرباء المستمرة.",
      "دعم الاستدامة البيئية من خلال اعتماد مصادر الطاقة المتجددة.",
      "المساهمة في بناء مستقبل طاقة أنظف وأكثر استقراراً في العراق."
    ],

    "vision": [
      "أن نكون المزود الرائد لحلول الطاقة الشمسية المستدامة والفعالة في العراق.",
      "تحسين جودة الحياة للأفراد والمؤسسات من خلال توفير طاقة نظيفة ومستقرة وعملية.",
      "تقديم بديل موثوق للمولدات الكهربائية التقليدية التي تعمل بالديزل.",
      "توفير أنظمة طاقة شمسية متكاملة وعالية الجودة تلبي احتياجات العملاء المتنوعة.",
      "ضمان خدمة عملاء استثنائية ودعم فني مستمر.",
      "تنفيذ حلول فعّالة لمعالجة تحديات الانقطاع المستمر في الكهرباء.",
      "تعزيز الاستدامة البيئية والمساهمة في مستقبل يعتمد على الطاقة النظيفة."
    ]
  },

  "solarImportance": {
    "title": "لماذا الطاقة الشمسية؟",
    "intro": "إن الإقبال المتزايد على الطاقة الشمسية من قبل الأفراد والشركات يأتي نتيجة فوائدها البيئية والاقتصادية الواضحة، مما يجعلها خياراً أساسياً في الانتقال نحو حلول طاقة مستدامة.",

    "features": [
      {
        "title": "صديقة للبيئة",
        "text": "تُعد الطاقة الشمسية مصدراً نظيفاً يقلل من انبعاثات الكربون ويساهم في حماية البيئة."
      },
      {
        "title": "موثوقة ومستدامة",
        "text": "تعتمد على مصدر متجدد وفير يضمن استمرارية التوفر والأداء الموثوق على المدى الطويل."
      },
      {
        "title": "موفرة وفعالة من حيث التكلفة",
        "text": "استثمار لمرة واحدة يحقق وفورات طويلة الأمد من خلال تقليل الاعتماد على تكاليف الكهرباء المتزايدة."
      },
      {
        "title": "تحقيق الاستقلالية في الطاقة",
        "text": "توفر الأنظمة الشمسية، خاصة عند دمجها مع البطاريات، طاقة موثوقة بعيداً عن تقلبات الشبكة الكهربائية."
      }
    ]
  },

  "newsCenter": {
    "titleRed": "الأخبار",
    "titleBlack": "والمقالات",
    "more": "اكتشف المزيد  >>>",
    "items": [
      {
        "id": "factory1",
        "image": "news1",
        "title": "كيف تختار الألواح الشمسية بدقة؟",
        "desc": "مع الانتشار الواسع لتوليد الطاقة الشمسية، بدأت هذه التقنية تدخل بقوة إلى الاستخدام العام..."
      },
      {
        "id": "factory2",
        "image": "news2",
        "title": "تحويل سطح المصنع إلى محطة طاقة",
        "desc": "مع تزايد أزمة الطاقة عالمياً، بدأت الشركات الصناعية والتجارية بالاعتماد على الأسطح المفتوحة..."
      },
      {
        "id": "factory3",
        "image": "news3",
        "title": "الأسواق الناشئة ومستقبل صناعة الطاقة الشمسية",
        "desc": "لطالما كانت صناعة الطاقة الشمسية محط أنظار العالم مع التطور المستمر في التقنيات..."
      },
      {
        "id": "factory4",
        "image": "news4",
        "title": "كيف تختار زاوية ميل محطة الطاقة الشمسية؟",
        "desc": "في عصر الطاقة المتجددة أصبحت محطات الطاقة الشمسية محور الاهتمام في قطاع الطاقة..."
      }
    ]
  },
  "milestones": {
    "title": "الإنجازات الرئيسية",
    "items": [
      {
        "date": "2024",
        "text": "تأسيس شركة جيل المستقبل لتقنيات المعلومات والتجارة العامة ذ.م.م، مع رؤية استراتيجية لتقديم حلول الطاقة الشمسية للسوق العراقي."
      },
      {
        "date": "2025",
        "text": "تنفيذ أكثر من 100 مشروع طاقة شمسية سكني وتجاري في بغداد وبابل، مما عزز حضورنا في السوق المحلي."
      },
      {
        "date": "آذار 2025",
        "text": "توقيع اتفاقية شراكة رسمية مع شركة PowerSolid لنصبح موردًا معتمدًا لمعدات الطاقة الشمسية عالية الجودة."
      },
      {
        "date": "حزيران 2025",
        "text": "افتتاح فرعنا الرئيسي في بغداد – شارع الصناعة، مما وسّع نطاق خدماتنا وعزز قدرات الدعم الفني."
      },
      {
        "date": "تموز 2025",
        "text": "الوصول إلى إنجاز كبير بإكمال أكثر من 150 مشروع طاقة شمسية، تشمل التركيبات الصغيرة والمتوسطة."
      },
      {
        "date": "2026",
        "text": "تحقيق محفظة تضم أكثر من 300 مشروع مكتمل، مما يمثل خطوة مهمة نحو التوسع على نطاق واسع ودخول المشاريع الحكومية."
      }
    ]
  }
}

